app/controllers/favorites_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 46]]
INSERT INTO "favorites" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 46], ["user_id", 1], ["created_at", "2016-01-03 18:01:01.184970"], ["updated_at", "2016-01-03 18:01:01.184970"]]
---
   def create
     post = Post.find(params[:post_id])
     favorite = current_user.favorites.build(post: post)

     if favorite.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 40]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 2]]
---
   def destroy
     post = Post.find(params[:post_id])
     favorite = current_user.favorites.find(params[:id])

     if favorite.destroy