app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 24]]
---
  def show
    @post = Post.find(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test the button"], ["body", "To check to see if the button works"], ["created_at", "2015-12-28 15:51:15.848463"], ["updated_at", "2015-12-28 15:51:15.848463"]]
---
  def create
    @topic = Topic.find(params[:topic_id])
    @post = @topic.posts.build(post_params)
    @post.user = current_user

    if @post.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @topic = Topic.find(params[:topic_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 48]]
---
  def edit
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 52]]
---
  def destroy
    @post = Post.find(params[:id])


     if @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Ugmnv pilkbu sif. Kchwiuvp vgmayipz vbtmc. Ovfzgnx bkg kbpaz vxa. Xyintzv evq bop dqsz nedu uefj uoat mstrf."], ["updated_at", "2015-12-29 11:49:50.015658"], ["id", 3]]
---
  def update
     @post = Post.find(params[:id])
     @post.assign_attributes(post_params)

     if @post.save