app/controllers/topics_controller.rb

INSERT INTO "labels" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "work"], ["created_at", "2016-01-02 15:28:41.859682"], ["updated_at", "2016-01-02 15:28:41.859682"]]
INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "create test"], ["description", "testing to see if this creates a new topic"], ["created_at", "2015-12-29 18:36:10.666323"], ["updated_at", "2015-12-29 18:36:10.666323"]]
---
  def create
    @topic = Topic.new(topic_params)
    @topic.labels = Label.update_labels(params[:topic][:labels])
    @topic.rating = Rating.update_rating(params[:topic][:rating])

    if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 15]]
---
  def edit
    @topic = Topic.find(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 16]]
UPDATE "topics" SET "name" = ?, "description" = ?, "public" = ?, "updated_at" = ? WHERE "topics"."id" = ?
---
  def update
     @topic = Topic.find(params[:id])

     @topic.assign_attributes(topic_params)

     if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 5]]
---
  def destroy
     @topic = Topic.find(params[:id])

     if @topic.destroy